import "./Q.css";
import drop from "./assets/dropicon.png";

let isOpen = false
function Explain(id){
  if(isOpen){
    document.getElementById("matn" + id).style.display="none"
   
    document.getElementById("test"+ id).style.height="120px"
    document.getElementById("img" + id).style.transform="rotate(360deg)"
    isOpen = false
  }else{
    // opening the box
    document.getElementById("matn" + id).style.display="block"
    document.getElementById("test"+ id).style.height="300px"
    document.getElementById("img"+ id).style.transform="rotate(180deg)"
    isOpen = true
  }
    
}


function Exit(ex){
    document.getElementById("matn" + ex).style.display="none"
   
    document.getElementById("test"+ ex).style.height="120px"
    document.getElementById("img" + ex).style.transform="rotate(360deg)"
 

   
}

function Question() {
  return (
    <div>
      <div className="yourq">
        <p>پرسش های شما</p>
      </div>
      <div className="one"  id="test1">
        <div>
          <p className="qs">نحوه ی ثبت نام به چه صورت است؟</p>
          <p className="explainbox" id="matn1"  onClick={()=> {Exit(1)}}>
          لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ، و با
          استفاده از طراحان گرافیک است، چاپگرها و متون بلکه روزنامه و مجله در
          ستون و سطرآنچنان که لازم است، و برای شرایط فعلی تکنولوژی مورد نیاز، و
          کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد، کتابهای زیادی
          در شصت و سه درصد گذشته حال و آینده، شناخت فراوان جامعه و متخصصان را می
          طلبد، تا با نرم افزارها شناخت بیشتری را برای طراحان رایانه ای علی
          الخصوص طراحان خلاقی، و فرهنگ پیشرو در زبان فارسی ایجاد کرد، در این
          صورت می توان امید داشت که تمام و دشواری موجود در ارائه راهکارها، و
          شرایط سخت تایپ به پایان رسد و زمان مورد نیاز شامل حروفچینی دستاوردهای
          اصلی، و جوابگوی سوالات پیوسته اهل دنیای موجود طراحی اساسا مورد استفاده
          قرار گیرد.
        </p>
        </div>
        <div>
          <img className="drop" id="img1" src={drop} onClick={()=> {Explain(1)}}/>
        </div>
      </div>
  
      {/* 1 */}
      <div className="one" id="test2">
        <div>
          <p className="qs">کلاس های آنلاین چگونه برگزار می شود؟</p>
          <p className="explainbox" id="matn2"  onClick={()=> {Exit(2)}}>
          لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ، و با
          استفاده از طراحان گرافیک است، چاپگرها و متون بلکه روزنامه و مجله در
          ستون و سطرآنچنان که لازم است، و برای شرایط فعلی تکنولوژی مورد نیاز، و
          کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد، کتابهای زیادی
          در شصت و سه درصد گذشته حال و آینده، شناخت فراوان جامعه و متخصصان را می
          طلبد، تا با نرم افزارها شناخت بیشتری را برای طراحان رایانه ای علی
          الخصوص طراحان خلاقی، و فرهنگ پیشرو در زبان فارسی ایجاد کرد، در این
          صورت می توان امید داشت که تمام و دشواری موجود در ارائه راهکارها، و
          شرایط سخت تایپ به پایان رسد و زمان مورد نیاز شامل حروفچینی دستاوردهای
          اصلی، و جوابگوی سوالات پیوسته اهل دنیای موجود طراحی اساسا مورد استفاده
          قرار گیرد.
        </p>
  
        </div>
        <div>
          <img className="drop" src={drop} onClick={()=> {Explain(2)}} id="img2"/>
        </div>
        
      </div>
      {/* 2 */}
      <div className="one"  id="test3">
        <div>
          <p className="qs">کلاس های حضوری چگونه برگزار می شود؟</p>
          <p className="explainbox" id="matn3"  onClick={()=> {Exit(3)}}>
          لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ، و با
          استفاده از طراحان گرافیک است، چاپگرها و متون بلکه روزنامه و مجله در
          ستون و سطرآنچنان که لازم است، و برای شرایط فعلی تکنولوژی مورد نیاز، و
          کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد، کتابهای زیادی
          در شصت و سه درصد گذشته حال و آینده، شناخت فراوان جامعه و متخصصان را می
          طلبد، تا با نرم افزارها شناخت بیشتری را برای طراحان رایانه ای علی
          الخصوص طراحان خلاقی، و فرهنگ پیشرو در زبان فارسی ایجاد کرد، در این
          صورت می توان امید داشت که تمام و دشواری موجود در ارائه راهکارها، و
          شرایط سخت تایپ به پایان رسد و زمان مورد نیاز شامل حروفچینی دستاوردهای
          اصلی، و جوابگوی سوالات پیوسته اهل دنیای موجود طراحی اساسا مورد استفاده
          قرار گیرد.
        </p>
        </div>
        <div>
          <img className="drop" src={drop} onClick={()=> {Explain(3)}} id="img3"/>
        </div>
      </div>
      {/* 3 */}
      <div className="one"  id="test4">
        <div>
          <p className="qs">تضمین قیمت به چه صورت است؟</p>
          <p className="explainbox" id="matn4"  onClick={()=> {Exit(4)}}>
          لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ، و با
          استفاده از طراحان گرافیک است، چاپگرها و متون بلکه روزنامه و مجله در
          ستون و سطرآنچنان که لازم است، و برای شرایط فعلی تکنولوژی مورد نیاز، و
          کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد، کتابهای زیادی
          در شصت و سه درصد گذشته حال و آینده، شناخت فراوان جامعه و متخصصان را می
          طلبد، تا با نرم افزارها شناخت بیشتری را برای طراحان رایانه ای علی
          الخصوص طراحان خلاقی، و فرهنگ پیشرو در زبان فارسی ایجاد کرد، در این
          صورت می توان امید داشت که تمام و دشواری موجود در ارائه راهکارها، و
          شرایط سخت تایپ به پایان رسد و زمان مورد نیاز شامل حروفچینی دستاوردهای
          اصلی، و جوابگوی سوالات پیوسته اهل دنیای موجود طراحی اساسا مورد استفاده
          قرار گیرد.
        </p>
        </div>
        <div>
          <img className="drop" src={drop} onClick={()=> {Explain(4)}} id="img4"/>
        </div>
      </div>
      {/* 4 */}
    </div>
  );
}
export default Question;
